src/cf/Catalogs/TypesOfLimitsForEmployees.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>TypesOfLimitsForEmployees</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AmountLimitControl</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CountLimitControl</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CheckLimitControl</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CloseUponDismissal</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExpenseItem</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OneTime</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashFlowItem</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CashFlowItems</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/TypesOfLimitsForEmployees/Forms/ItemForm/Ext/Form/Module.bsl
#Region EventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)

	If Parameters.Key = Undefined Or Parameters.Key.IsEmpty() Then
		Object.AmountLimitControl = True;
		Object.CountLimitControl = False;
		Object.CheckLimitControl = False;
	EndIf;

	GeneralFormSetup();

	SetVisibilityAndAccessibility();

EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)

	CurrentObject.AmountLimitControl = ResourceType = 0;
	CurrentObject.CountLimitControl = ResourceType = 1;
	CurrentObject.CheckLimitControl = ResourceType = 2;

EndProcedure

&AtServer
Procedure FillCheckProcessingAtServer(Cancel, CheckedAttributes)

	If ValueIsFilled(Object.CashFlowItem) Then

		Query = New Query;
		Query.Text =
		"SELECT
		|	TypesOfLimitsForEmployees.Ref AS Ref
		|FROM
		|	Catalog.TypesOfLimitsForEmployees AS TypesOfLimitsForEmployees
		|WHERE
		|	TypesOfLimitsForEmployees.CashFlowItem = &CashFlowItem
		|	AND TypesOfLimitsForEmployees.Ref <> &Ref";

		Query.SetParameter("Ref", Object.Ref);
		Query.SetParameter("CashFlowItem", Object.CashFlowItem);

		QueryResult = Query.Execute();
		If Not QueryResult.IsEmpty() Then
			TextTemplate = NStr("ru = 'Статья движения денежных средств ""%1"" не может быть использована, так как она соответствует другому виду лимитов';
								|en = 'Cash flow item ""%1"" cannot be used, because it corresponds to a different type of limit'");
			CommonClientServer.MessageToUser(StrTemplate(TextTemplate, String(Object.CashFlowItem)),, "Object.CashFlowItem",, Cancel);
		EndIf;
	EndIf;

EndProcedure

#EndRegion

#Region ItemEventHandlers

&AtClient
Procedure ResourceTypeOnChange(Item)

	If ResourceType = 2 Then
		Object.OneTime = True;
	EndIf;

	SetVisibilityAndAccessibility();

EndProcedure
 
#EndRegion

#Region InternalProceduresAndFunctions

&AtServer
Procedure GeneralFormSetup(OnCreateAtServer = False, WriteParameters = Undefined)

	If Object.CountLimitControl Then
		ResourceType = 1;

	ElsIf Object.CheckLimitControl Then
		ResourceType = 2;
	Else
		ResourceType = 0;
	EndIf;

EndProcedure

&AtServer 
Procedure SetVisibilityAndAccessibility() 

	Items.OneTime.Visible = ResourceType = 0
							Or ResourceType = 1;

EndProcedure // SetVisibilityAndAccessibility()

#EndRegion
